var dPcate = document.searchForm;
var dPcatesp = document.searchFormm;
var dPcatewatch = document.searchFormmm;
//创建多维数组
function fArray(){
	var Len = arguments.length;
	if(Len===0) return [];
	
	var Arg = fGetArg.apply(this,arguments);
	var Ar = new Array(arguments[0]);
	
	for(var i=0,j=arguments[0];i<j;i++){
		if(Len>1)
			Ar[i] = fArray.apply(null,Arg.slice(1));
	}
	
	if(typeof(Ar[0])=="undefined"){
		var Count = Ar.length;
		for(var i=0; i<Count;i++)
			Ar[i] = "";
	}
	return Ar;
}
function fGetArg(){
	var Ar = [];
	var Len = arguments.length;
	for(var i=0;i<Len;i++){
		Ar[i] = arguments[i];
	}
	return Ar;
}


//定义数组变量
var pcatez		= new Array("总类|9996");	//总类
var pcate1	= fArray(1,30);				//一级类
var pcate2		= fArray(1,30,50);			//二级类
var pcate3		= fArray(1,30,50,50);		//三级类


pcate1[0]	= ["动力机械|9","耕整地机械|1","种植施肥机械|2","田间管理机械|3","收获机械|4","收获后处理机械|5","农产品加工机械|6","排灌机械|7","畜牧水产养殖机械|8","农机配套与配件|334","农田基本建设机械|10","设施农业设备|11","农业运输机械|278","其它机械|12"];

pcate2[0][0]=["拖拉机|181"];

pcate2[0][1]=["耕地机械|13","整地机械|14"];

pcate2[0][2]=["播种机械|38","育苗机械设备|39","栽植机械|40","施肥机械|41","地膜机械|42","断根机械|273","食用菌生产机械|388","其它机械|275"];

pcate2[0][3]=["中耕机械|67","植保机械|68","园林机械|69"];

pcate2[0][4]=["谷物收获机械|86","玉米收获机械|87","棉麻作物收获机|88","花卉(茶叶)采收机械|89","果实收获机械|769","籽粒作物收获机械|90","根茎作物收获机械|91","饲料作物收获机械|92","茎秆收集处理机械|93"];

pcate2[0][5]=["脱粒机械|123","清选机械|261","剥壳(去皮)机械|124","干燥机械|125","种子加工机械|392","仓储机械|126"];

pcate2[0][6]=["碾米机械|137","磨粉(浆)机械|138","果蔬加工机械|139","茶叶加工机械|140","剑麻加工机械|395","天然橡胶初加工专用机械|398","榨油机械|224","榨糖机械|303","棉花加工机械|305","食品加工机械|285","畜产品加工机械|438"];

pcate2[0][7]=["水泵|151","喷灌机械设备|152","喷洒设备|323"];

pcate2[0][8]=["饲料(草)加工机械设备|157","畜牧饲养机械|158","畜产品采集加工机械设备|159","水产养殖机械|160","桑蚕养殖机械|332"];

pcate2[0][9]=["动力部件|664","传动部件|665","行走部件|666","转向部件|668","电器内饰|670","割台脱粒|667","耕种部件|671","综合部件|672","油品|757"];

pcate2[0][10]=["挖掘机械|185","平地机械|186","清淤机械|187","装载机械|227","起重机械|311"];

pcate2[0][11]=["成套温室|498","卷帘设备|506","加温设备|497","降温设备|499","病虫防治设备|500","补光设备|501","开窗拉幕系统|502","灌溉施肥|503","温室资材|504","通风设备|505","其它温室配套设备|507"];

pcate2[0][12]=["农业运输车|316","悬挂配套设备|279"];

pcate2[0][13]=["废弃物处理设备|207","包装机械|229","生物质能设备|239","物理农业设备|244","其它生产机械|419","其它机械|487"];

pcate3[0][0][0]=["轮式拖拉机|182","手扶拖拉机|183","履带式拖拉机|184"];

pcate3[0][1][0]=["铧式犁|15","翻转犁|16","圆盘犁|17","旋耕机|18","耕整机|19","微耕机|20","田园管理机|21","开沟机(器)|22","浅松机|23","深松机|24","浅耕深松机|25","机滚船|26","机耕船|27","联合整地机|385","复式犁|454","悬挂犁|455"];

pcate3[0][1][1]=["钉齿耙|28","弹齿耙|30","圆盘耙|31","滚子耙|32","驱动耙|33","起垄机|34","镇压器|35","合墒器|36","灭茬机|37"];

pcate3[0][2][0]=["条播机|43","穴播机|44","异型种子播种机|45","小粒种子播种机|46","根茎类种子播种机|47","水稻(水旱)直播机|48","免耕播种机|49","抗旱坐水种机械|386","施肥播种机|427","旋耕播种机|450","节水精播机械|451","多功能播种机械|479"];

pcate3[0][2][1]=["秧盘播种成套设备|50","秧田播种机|51","种子处理设备|52","营养钵压制机|53","起苗机|54","床土清选设备|471"];

pcate3[0][2][2]=["油菜栽植机|55","水稻插秧机|56","水稻摆秧机|57","甘蔗种植机|58","草皮栽补机|59","树木移栽机|60","甜菜移栽机|387","烟草移栽机|472","多功能移栽机|475"];

pcate3[0][2][3]=["施肥机(化肥)|61","撒肥机(厩肥)|62","追肥机(液肥)|63","中耕追肥机|64","施肥机械辅件|428","旋播施肥机|429","旋耕施肥机|430"];

pcate3[0][2][4]=["地膜覆盖机|65","残膜回收机|66"];

pcate3[0][2][5]=["断根机|274"];

pcate3[0][2][6]=["培养料处理设备|473","菌草切割机|474"];

pcate3[0][2][7]=["硒砂瓜生产专用机械|276","烟叶生产机械|277"];

pcate3[0][3][0]=["中耕机|70","培土机|71","除草机|72","埋藤机|73"];

pcate3[0][3][1]=["电动喷雾器|74","机动喷雾喷粉机|75","动力喷雾机|76","喷杆式喷雾机|77","风送式喷雾机|78","烟雾机|79","杀虫灯|80","手动喷雾器|447","育果袋|470","植保无人机|768"];

pcate3[0][3][2]=["嫁接设备|81","割灌机|85","修剪设备|457","切割机|458","移植机|459","吹风机|460","灭火机|463","草坪车|464","粉碎机|465","苗木草籽播种设备|467"];

pcate3[0][4][0]=["自走轮式谷物联合收割机(全喂入)|94","自走履带式谷物联合收割机(全喂入)|95","半喂入联合收割机|96","大豆收获专用割台|97","割晒机|98","割捆机|99","背负式谷物联合收割机|431","多功能谷物联合收割机|483","小型收割机|489","其他谷物收获机械|494"];

pcate3[0][4][1]=["背负式玉米收获机|100","自走式玉米收获机|101","穗茎兼收玉米收获机|103","玉米籽粒收获机|484","互换割台式玉米收割机|485","玉米收获割台|492","自走式玉米联合收割机|754"];

pcate3[0][4][2]=["棉花收获机|104","麻类作物收获机|105"];

pcate3[0][4][3]=["采茶机|106","花卉采摘机|384"];

pcate3[0][4][4]=["番茄收获机|770","红枣收获机|771","葡萄收获机|772"];

pcate3[0][4][5]=["草籽收获机|108","油菜收获机|486","大豆收获机械|490"];

pcate3[0][4][6]=["薯类收获机|110","甘蔗收获机|111","甘蔗割铺机|112","甘蔗剥叶机|113","甜菜收获机|389","大蒜收获机|264","甘蔗装载提升机|265","根类收获机械|266","土豆收获机|434","花生收获机械|445","其他根茎作物收获机械|493"];

pcate3[0][4][7]=["青饲料收获机|114","牧草收获机|115","割草机|116","翻晒机|117","搂草机|118","捡拾压捆机|119","压捆机|120","饲草裹包机|390","其他饲料作物收获机械|495"];

pcate3[0][4][8]=["秸秆粉碎还田机|121","高杆作物割晒机|122","秸秆收获机|433"];

pcate3[0][5][0]=["稻麦脱粒机|127","玉米脱粒机|128","葵花脱粒机(筛选机)|260"];

pcate3[0][5][1]=["粮食清选机|262","种子清选机|391","扬场机|263","粮食分级机|327"];

pcate3[0][5][2]=["玉米剥皮机|129","花生脱壳机|130","棉籽剥壳机|131","板栗苞剥离机|256","脱脯机|257","小麦去壳机|437","水稻脱壳机|443"];

pcate3[0][5][3]=["粮食烘干机|132","种子烘干机|133","油菜籽烘干机|134","热风炉|135","果蔬烘干机|258","农副产品烘干机|259"];

pcate3[0][5][4]=["种子包衣机|393"];

pcate3[0][5][5]=["简易保鲜储藏设备|136"];

pcate3[0][6][0]=["碾米机|141","成套设备|223"];

pcate3[0][6][1]=["磨粉机|142","成套设备|220","分离机|221","粉碎机|222"];

pcate3[0][6][2]=["水果分级机|143","水果打蜡机|144","蔬菜清洗机|394","薯类分级机|145","蔬菜分级机|146","水果清洗机|218","水果输送机|477"];

pcate3[0][6][3]=["茶叶杀青机|147","茶叶揉捻机|148","茶叶炒(烘)机|149","茶叶筛选机|150","茶鲜叶输送机|213","茶叶包装机械|214","茶叶加工成套设备|215","茶叶理条机|216","茶叶提香机|217","茶叶干燥机|476"];

pcate3[0][6][4]=["刮麻机|396","理麻机|397"];

pcate3[0][6][5]=["橡胶初加工机械|491"];

pcate3[0][6][6]=["榨油机|225","滤油机|302"];

pcate3[0][6][7]=["榨糖机|304","甘蔗榨糖机械|448"];

pcate3[0][6][8]=["棉花清理机|306","集棉(绒)机|307","棉花夹包车|308","棉花打包机|309"];

pcate3[0][6][9]=["粉条粉丝机|286","食用菌加工机械|288","乳制品加工机械|290","面食加工机械|291","豆制品加工机械|292","饮料加工机械|293","榨汁机|294","烧烤设备|295","消毒设备|296","食品膨化设备|297","去皮设备|298","食品切割设备|299","糕点烤焙设备|300","食品搅拌机械|301","食品烹调设备|405","食品研磨设备|406"];

pcate3[0][6][10]=["屠宰加工机械|439"];

pcate3[0][7][0]=["离心泵|153","潜水泵|154"];

pcate3[0][7][1]=["喷灌机|155","微灌设备|156"];

pcate3[0][7][2]=["洒水车|324","喷洒机|481"];

pcate3[0][8][0]=["青贮切碎机|161","铡草机|162","揉丝机|163","压块机|164","饲料粉碎机|165","饲料混合机|166","饲料破碎机|167","饲料搅拌机|168","青饲取(卸)料机|268","饲草制粒机|269","饲料包装机|270","饲喂机械|271","颗粒饲料压制机|399","饲料成套设备|453"];

pcate3[0][8][1]=["孵化机|169","喂料机|170","送料机|171","繁殖育种设备|328","保温通风设备|329","称重设备|330","清粪机(车)|172","卫生消毒、医用器械|331","药浴机|173","网围栏|400","饮水设备|421","笼养设备|452"];

pcate3[0][8][2]=["挤奶机|174","剪羊毛机|175","储奶罐|176","冷藏罐|401","牛奶分离器|272"];

pcate3[0][8][3]=["增氧机|177","投饵机|178","网箱养殖设备|179","水体净化处理设备|180","织网机|402","养殖成套设备|469"];

pcate3[0][8][4]=["桑蚕机械|333"];

pcate3[0][9][0]=["单缸柴油机|673","多缸柴油机|674","汽油机|675","煤气机|676","发电机|677","混合型内燃机|678"];

pcate3[0][9][1]=["变速箱|679","连杆|680","离合器|681","差速器|682","壳体|683","传动胶带|684","链条|685","传动轴|738","其它|739"];

pcate3[0][9][2]=["前桥|686","后桥|687","驱动轮|688","导向轮|689","车架总成|690","履带|691","轮胎|692","操纵手柄|693","杆件|694","刹车片|740","轮毂|741","其它|742"];

pcate3[0][9][3]=["方向机|774","方向盘|701","转向器|702","单稳阀|703","多路阀|704","液压管路|705","液压油箱|706","其它|743"];

pcate3[0][9][4]=["仪表|711","照明|712","电瓶|713","控制线|714","座椅|715","信号|716","电磁阀|717","其它|744"];

pcate3[0][9][5]=["割台体|695","喂入撹拢|696","拨禾轮|697","输送过桥|698","摆环箱总成|699","割刀总成|700","脱粒滚筒|745","风机|749","清选筛|750","凹板|751","刀片|752","打捆绳|773","其它|753"];

pcate3[0][9][6]=["开沟器|718","播种箱|719","肥箱|720","排种器|721","镇压轮|722","育秧盘|723","旋耕刀|746","其它|747"];

pcate3[0][9][7]=["测亩仪|724","油箱|725","供油管路|726","启动器|727","散热器|728","齿轮|729","齿轮泵|730","缸套|731","轴承|732","密封件|734","滤清器|735","万向节|736","连接件|748","其它|737"];

pcate3[0][9][8]=["机油|758","润滑油|759","基础油|760","液压油|761","齿轮油|762","防冻油|763","黄油|764","润滑脂|765","锭子油|766","其它油品|767"];

pcate3[0][10][0]=["挖掘机|188","挖坑机|189","铲运机|226","推土机|310","钻土机|468"];

pcate3[0][10][1]=["平地机|190","打夯机|404"];

pcate3[0][10][2]=["挖泥船|191","清淤机|192"];

pcate3[0][10][3]=["装载机|228","叉车|436"];

pcate3[0][10][4]=["履带式起重机|312","轮胎式起重机|313","塔式起重机|314","抓斗起重机|315","悬臂起重机|461","吊车|462"];

pcate3[0][11][0]=["PC板温室|600","玻璃温室|601","薄膜温室|602"];

pcate3[0][11][1]=["保温被卷铺系统|603","卷帘机|604","卷膜系统|605"];

pcate3[0][11][2]=["热风炉|606","地温中央空调|607","锅炉|608","加温机|609","加温炉|610","气化取暖炉|611","散热器|612"];

pcate3[0][11][3]=["喷雾器|613","内遮阳系统|614","喷淋降温系统|615","湿帘降温系统|616","外遮阳系统|617"];

pcate3[0][11][4]=["臭氧发生器|618","电除雾防病促生系统|619","空间电场促蕾防病系统|620","杀虫灯|621"];

pcate3[0][11][5]=["补光灯|622","补光系统|623"];

pcate3[0][11][6]=["开窗机|624","开窗系统|625","拉幕系统|626"];

pcate3[0][11][7]=["滴灌管/带|627","滴头|628","二氧化碳发生器|629","灌溉施肥一体化设备|630","灌溉首部|631","施肥器|632","水泵|633","微喷头|634","智能气肥机|635","注肥泵|636","自动控制喷灌系统|637"];

pcate3[0][11][8]=["PC板|638","玻璃|639","塑料薄膜|640","补膜胶带|641","箍膜卡箍|642","卡槽|643","托幕线|644","压膜线|645","遮阳网|646","保温被|647","齿轮齿条|648","地布|649","电机|650","防虫网|651","降温涂料|652","卡簧|653","温帘|654","温室骨架|655","其它|656"];

pcate3[0][11][9]=["环流风机|657","排风机|658"];

pcate3[0][11][10]=["检测控制设备|659","苗床系统|660","大棚骨架机|661","声波助长|662","其它温室配套设备|663"];

pcate3[0][12][0]=["三轮农用运输车|317","四轮农用运输车|318","小型拖拉机变形运输车|319","卡车|320"];

pcate3[0][12][1]=["特殊挂车|280","拖拉机挂车|321","农船用挂机挂浆|322"];

pcate3[0][13][0]=["固液分离机|208","废弃物料烘干机|209","有机废弃物好氧发酵翻堆机|210","有机废弃物干式厌氧发酵装置|211","沼液沼渣抽排设备|403","沼气处理设备|238","其它废弃物处理设备|237"];

pcate3[0][13][1]=["颗粒计量包装机|230","面粉计量包装机|231","真空包装机|232","直放料式称量分装机组|233","装袋机|234","自动称量包装机组|235","自动称量分装机组|236","封装机械|325","打包机|326","包装袋|418","灌装机|444","制绳机|478"];

pcate3[0][13][2]=["发电设备|240","秸秆气化设备|241","秸秆燃料致密成型设备|242","沼气灶|243","颗粒机|480"];

pcate3[0][13][3]=["粪道等离子体灭菌除臭系统|245","声波助长仪|246","土壤连作障碍电处理机|247","温室病害臭氧防治机|248","温室电除雾防病促生系统|249","畜禽舍空气电净化防病防疫系统|250","烟气电净化CO2气肥增施机|251","种子培育机械|252","测距仪|413"];

pcate3[0][13][4]=["其它设备|420"];

pcate3[0][13][5]=["其它机械|488"];




if("undefined"==typeof dPcate) dPcate = document.proForm;
if("undefined"==typeof dPcatesp) dPcatesp = document.proFormm;

if("undefined"==typeof dPcatewatch) dPcatewatch = document.proFormmm;


var pcates	= 0;				//索引，默认总类的索引值
var pcate1s_init= 0;				//默认一级类索引
var pcate2s_init= 0;				//默认二级类索引

//创建省选项，v初始化VALUE值，如果VALUE等于v则就选中至为v的项

function SetPcate1(v){
	for(var i=0;i<pcate1[0].length;i++){
		oPro	= pcate1[0][i].split("|");
		proText	= oPro[0];		
       dPcate.pcate1id.options[i+1] = new Option(proText);
		dPcatesp.pcate1id.options[i+1] = new Option(proText);
		dPcatewatch.pcate1id.options[i+1] = new Option(proText);


		
		//根据默认值确定该项是否被默认选中


	}
}

//创建二级类选项，pcate1s_init选择的一级类的索引值，v为二级类的默认ID值
function SetPcate2(pcate1s_init,v){
	if(pcate1s_init > -1){
		for(var i=0;i<pcate2[pcates][pcate1s_init].length;i++){
			oCity	= pcate2[pcates][pcate1s_init][i].split("|");
			if(oCity != ""){
				cityText= oCity[0];
                dPcate.pcate2id.options[i+1] = new Option(cityText);
				dPcatesp.pcate2id.options[i+1] = new Option(cityText);
				dPcatewatch.pcate2id.options[i+1] = new Option(cityText);


				//根据默认值确定该项是否被默认选中
		
			}
		}
	}
	
}
// var loca3;
//创建三级类，pcate1s_init选择的一级类的索引值，pcate2s_init选择的二级类的索引值，v三级类的默认ID值
function SetPcate3(pcate1s_init,pcate2s_init,v){
	if(pcate1s_init > -1 && pcate2s_init > -1){
		for(var i=0;i<pcate3[pcates][pcate1s_init][pcate2s_init].length;i++){
			oSeat	= pcate3[pcates][pcate1s_init][pcate2s_init][i].split("|");
			if(oSeat != ""){
				seatText= oSeat[0];

				dPcate.pcate3id.options[i+1] = new Option(seatText);
				dPcatesp.pcate3id.options[i+1] = new Option(seatText);
				dPcatewatch.pcate3id.options[i+1] = new Option(seatText);

				// loca3 =seatText
				// console.info(loca3)

				//根据默认值确定该项是否被默认选中
			
			}
		}
	}
}
 


//更改一级类
var loca1;
dPcate.pcate1id.onchange = function(){
	var pcate1s_init = this.selectedIndex;
	 loca1=dPcate.pcate1id.options[pcate1s_init].innerHTML;
	
	
	 $("#pubSupplyHireEquipment_classify").val(loca1+",");
	var  jiaoyitype =$("#pubSupplyHireEquipment_jiaoyitype").val();
	 $("#pubSupplyHireEquipment_title").val(jiaoyitype+"+"+loca1);
	pcate1s_init--;
	//初始地级市

	
	//创建地级市选项
	SetPcate2(pcate1s_init,0);
}
dPcatesp.pcate1id.onchange = function(){
	var pcate1s_init = this.selectedIndex;
	 loca1=dPcatesp.pcate1id.options[pcate1s_init].innerHTML;

	 $("#pubDemandHireEquipment_classify").val(loca1+",");
	var  jiaoyitype =$("#pubDemandHireEquipment_jiaoyitype").val();
	$("#pubDemandHireEquipment_title").val(jiaoyitype+"+"+loca1);

	pcate1s_init--;
	//初始地级市

	
	//创建地级市选项
	SetPcate2(pcate1s_init,0);
}
dPcatewatch.pcate1id.onchange = function(){
	var pcate1s_init = this.selectedIndex;
	 loca1=dPcatewatch.pcate1id.options[pcate1s_init].innerHTML;

	 $("#btnwithclassify").val(loca1+",");
	 $("#classify").text(loca1+",");

	pcate1s_init--;
	//初始地级市

	
	//创建地级市选项
	SetPcate2(pcate1s_init,0);
}


//更改二级类
var loca2;
dPcate.pcate2id.onchange = function(){
	var pcate2s_init = this.selectedIndex;
	 loca2=dPcate.pcate2id.options[pcate2s_init].innerHTML;

	 $("#pubSupplyHireEquipment_classify").val(loca1+","+loca2);
	pcate2s_init--;
	
	//创建县级市选项
	SetPcate3(dPcate.pcate1id.selectedIndex-1,pcate2s_init,0);
}
dPcatesp.pcate2id.onchange = function(){
	var pcate2s_init = this.selectedIndex;
	 loca2=dPcatesp.pcate2id.options[pcate2s_init].innerHTML;

	 $("#pubDemandHireEquipment_classify").val(loca1+","+loca2);

	pcate2s_init--;
	
	//创建县级市选项
	SetPcate3(dPcatesp.pcate1id.selectedIndex-1,pcate2s_init,0);
}

dPcatewatch.pcate2id.onchange = function(){
	var pcate2s_init = this.selectedIndex;
	 loca2=dPcatewatch.pcate2id.options[pcate2s_init].innerHTML;

	 $("#btnwithclassify").val(loca1+","+loca2);
	 $("#classify").text(loca1+","+loca2);

	pcate2s_init--;
	
	//创建县级市选项
	SetPcate3(dPcatewatch.pcate1id.selectedIndex-1,pcate2s_init,0);
}

var loca3;
dPcate.pcate3id.onchange = function(){
	var pcate3s_init = this.selectedIndex;
	 loca3=dPcate.pcate3id.options[pcate3s_init].innerHTML;


	 $("#pubSupplyHireEquipment_classify").val(loca1+","+loca2+","+loca3);
		
}
dPcatesp.pcate3id.onchange = function(){
	var pcate3s_init = this.selectedIndex;
	 loca3=dPcatesp.pcate3id.options[pcate3s_init].innerHTML;
	
	 $("#pubDemandHireEquipment_classify").val(loca1+","+loca2+","+loca3);

		
}
dPcatewatch.pcate3id.onchange = function(){
	var pcate3s_init = this.selectedIndex;
	 loca3=dPcatewatch.pcate3id.options[pcate3s_init].innerHTML;
	
	 $("#btnwithclassify").val(loca1+","+loca2+","+loca3);
	 $("#classify").text(loca1+","+loca2+","+loca3);

		
}

/*默认初始化选项，登录页面即调用该方法
*	proclass1:一级类的ID值
*	proclass2:二级类的ID值
*	proclass3:三级类的ID值
*/
// function initialize_procate(proclass1,proclass2,proclass3){
// 	//初始化省份选项
// 	SetPcate1(nj.CInt(proclass1));
	
// 	//如果省份有默认值则初始化地级市选项
// 	if(nj.CInt(proclass1) > 0){
// 		SetPcate2(pcate1s_init,nj.CInt(proclass2));
		
// 		//如果地级市有默认值则初始化县级市
// 		if(nj.CInt(proclass2) > 0){
// 			SetPcate3(pcate1s_init,pcate2s_init,nj.CInt(proclass3));
// 		}
// 	}
// }